using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Runtime.InteropServices;

namespace 麻将
{
    public static class ExtendMethods
    {
        public static readonly string[][] _牌显示 = new string[][]
        {
            new string[] {},
	        new string[] { "", "一万", "二万", "三万", "四万", "五万", "六万", "七万", "八万", "九万" },
	        new string[] { "", "一条", "二条", "三条", "四条", "五条", "六条", "七条", "八条", "九条" },
	        new string[] { "", "一筒", "二筒", "三筒", "四筒", "五筒", "六筒", "七筒", "八筒", "九筒" },
	        new string[] { "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "红中", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", 
                "发财", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "白板" },
            new string[] { "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "东风", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "南风", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "西风", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "北风" },
            new string[] { "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "春", "梅", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "夏", "兰", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "秋", "竹", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
                "冬", "菊" },
        };

        public static string ToDisplayString(this 牌 p)
        {
            return string.Format("{0} x {1}", _牌显示[p.花][p.点], p.张);
        }
    }

    public class Handler
    {
        public static readonly 牌[] 一副牌 = new 牌[] {
            // 万
            new 牌 { 整个 = 0x040101 }, 
            new 牌 { 整个 = 0x040102 }, 
            new 牌 { 整个 = 0x040103 }, 
            new 牌 { 整个 = 0x040104 }, 
            new 牌 { 整个 = 0x040105 }, 
            new 牌 { 整个 = 0x040106 }, 
            new 牌 { 整个 = 0x040107 }, 
            new 牌 { 整个 = 0x040108 }, 
            new 牌 { 整个 = 0x040109 }, 
            // 条
            new 牌 { 整个 = 0x040201 }, 
            new 牌 { 整个 = 0x040202 }, 
            new 牌 { 整个 = 0x040203 }, 
            new 牌 { 整个 = 0x040204 }, 
            new 牌 { 整个 = 0x040205 }, 
            new 牌 { 整个 = 0x040206 }, 
            new 牌 { 整个 = 0x040207 }, 
            new 牌 { 整个 = 0x040208 }, 
            new 牌 { 整个 = 0x040209 }, 
            // 筒
            new 牌 { 整个 = 0x040301 }, 
            new 牌 { 整个 = 0x040302 }, 
            new 牌 { 整个 = 0x040303 }, 
            new 牌 { 整个 = 0x040304 }, 
            new 牌 { 整个 = 0x040305 }, 
            new 牌 { 整个 = 0x040306 }, 
            new 牌 { 整个 = 0x040307 }, 
            new 牌 { 整个 = 0x040308 }, 
            new 牌 { 整个 = 0x040309 }, 
            // 字
            new 牌 { 整个 = 0x040410 }, 
            new 牌 { 整个 = 0x040420 }, 
            new 牌 { 整个 = 0x040430 }, 
            // 风
            new 牌 { 整个 = 0x040510 }, 
            new 牌 { 整个 = 0x040520 }, 
            new 牌 { 整个 = 0x040530 }, 
            new 牌 { 整个 = 0x040540 }, 
            // 花
            new 牌 { 整个 = 0x010610 }, 
            new 牌 { 整个 = 0x010611 }, 
            new 牌 { 整个 = 0x010620 }, 
            new 牌 { 整个 = 0x010621 }, 
            new 牌 { 整个 = 0x010630 }, 
            new 牌 { 整个 = 0x010631 }, 
            new 牌 { 整个 = 0x010640 }, 
            new 牌 { 整个 = 0x010641 }, 
        };

        private static 牌[] _一副牌单张序列 = null;
        public static 牌[] 一副牌单张序列
        {
            get
            {
                if (_一副牌单张序列 == null)
                {
                    _一副牌单张序列 = new 牌[(144)]; // 9 * 4 * 3 + 3 * 4 + 4 * 4 + 8 * 1
                    var counter = 0;
                    foreach (var p in 一副牌)
                    {
                        for (int i = 0; i < p.张; i++)
                        {
                            _一副牌单张序列[counter++].整个 = p.花点 | 0x010000;
                        }
                    }
                }
                return _一副牌单张序列;
            }
        }
    }
}
